[
  {
    "id": 1,
    "title": "Spaghetti Carbonara",
    "summary": "A classic Italian pasta dish with eggs, cheese, bacon, and black pepper.",
    "instructions": [
      "Cook the spaghetti according to the package instructions.",
      "In a bowl, whisk together eggs and grated cheese.",
      "Cook the bacon in a pan until crispy, then crumble into pieces.",
      "Drain the pasta and mix with the egg mixture and bacon.",
      "Season with salt and pepper to taste and serve."
    ],
    "image": "https://via.placeholder.com/150"
  },
  {
    "id": 2,
    "title": "Chicken Tikka Masala",
    "summary": "Chunks of grilled chicken (tikka) cooked in a smooth buttery & creamy tomato-based gravy.",
    "instructions": [
      "Marinate the chicken with yogurt, spices, and lemon juice for at least 2 hours.",
      "Grill or bake the chicken until cooked through.",
      "Prepare the masala sauce by cooking onions, garlic, ginger, and tomatoes.",
      "Add cream, spices, and the grilled chicken to the sauce.",
      "Simmer until the sauce thickens and the chicken is well-coated.",
      "Serve with rice or naan bread."
    ],
    "image": "https://via.placeholder.com/150"
  },
  {
    "id": 3,
    "title": "Beef Stroganoff",
    "summary": "A Russian dish of sautéed beef served in a creamy sauce with mushrooms.",
    "instructions": [
      "Sauté onions and garlic in butter until translucent.",
      "Add mushrooms and cook until they are soft.",
      "Brown the beef strips in the pan and then remove them.",
      "Deglaze the pan with beef broth and add sour cream.",
      "Return the beef and mushrooms to the pan and mix well.",
      "Serve over noodles or rice."
    ],
    "image": "https://via.placeholder.com/150"
  },
  {
    "id": 4,
    "title": "Margherita Pizza",
    "summary": "A simple pizza with fresh tomatoes, mozzarella cheese, and basil.",
    "instructions": [
      "Prepare the pizza dough and let it rise.",
      "Spread tomato sauce over the dough.",
      "Add slices of fresh mozzarella and basil leaves.",
      "Drizzle with olive oil.",
      "Bake in a hot oven until the crust is crispy and golden.",
      "Garnish with additional fresh basil."
    ],
    "image": "https://via.placeholder.com/150"
  },
  {
    "id": 5,
    "title": "Fish Tacos",
    "summary": "Crispy fish fillets served with fresh salsa, cabbage slaw, and lime in a tortilla.",
    "instructions": [
      "Prepare a batter for the fish and fry until golden brown.",
      "Mix shredded cabbage with lime juice for the slaw.",
      "Prepare a fresh salsa with tomatoes, onions, and cilantro.",
      "Assemble the tacos with fried fish, cabbage slaw, and salsa.",
      "Serve with lime wedges and hot sauce."
    ],
    "image": "https://via.placeholder.com/150"
  },
  {
    "id": 6,
    "title": "Vegetable Stir Fry",
    "summary": "A quick and healthy stir fry with a variety of fresh vegetables and a savory sauce.",
    "instructions": [
      "Cut vegetables into bite-sized pieces.",
      "Stir-fry garlic and ginger in hot oil.",
      "Add vegetables and cook until tender-crisp.",
      "Stir in soy sauce, sesame oil, and a pinch of sugar.",
      "Serve with rice or noodles."
    ],
    "image": "https://via.placeholder.com/150"
  },
  {
    "id": 7,
    "title": "Shrimp Scampi",
    "summary": "A garlic-butter shrimp dish served with pasta.",
    "instructions": [
      "Cook pasta until al dente.",
      "Sauté garlic in butter and olive oil.",
      "Add shrimp and cook until pink.",
      "Stir in white wine and lemon juice.",
      "Toss the shrimp with cooked pasta and chopped parsley.",
      "Serve with Parmesan cheese."
    ],
    "image": "https://via.placeholder.com/150"
  },
  {
    "id": 8,
    "title": "Butter Chicken",
    "summary": "Tender chicken pieces cooked in a creamy, spiced tomato sauce.",
    "instructions": [
      "Marinate chicken with yogurt and spices.",
      "Fry onions, ginger, and garlic until golden.",
      "Add tomatoes and spices and cook.",
      "Stir in cream and butter, then add marinated chicken.",
      "Simmer until chicken is cooked through.",
      "Serve with rice or naan bread."
    ],
    "image": "https://via.placeholder.com/150"
  },
  {
    "id": 9,
    "title": "Caprese Salad",
    "summary": "A simple and refreshing Italian salad with tomatoes, mozzarella, and basil.",
    "instructions": [
      "Slice fresh tomatoes and mozzarella cheese.",
      "Arrange slices on a plate, alternating tomato and mozzarella.",
      "Add fresh basil leaves.",
      "Drizzle with olive oil and balsamic vinegar.",
      "Season with salt and pepper to taste."
    ],
    "image": "https://via.placeholder.com/150"
  },
  {
    "id": 10,
    "title": "Eggplant Parmesan",
    "summary": "Breaded and fried eggplant slices layered with marinara sauce and cheese.",
    "instructions": [
      "Slice and salt the eggplant to remove excess moisture.",
      "Bread and fry the eggplant slices until golden.",
      "Layer fried eggplant with marinara sauce and mozzarella cheese.",
      "Bake until bubbly and golden.",
      "Serve with pasta or a side salad."
    ],
    "image": "https://via.placeholder.com/150"
  },
  {
    "id": 11,
    "title": "Chicken Tikka Masala",
    "summary": "Chunks of grilled chicken (tikka) cooked in a smooth buttery & creamy tomato-based gravy.",
    "instructions": [
      "Marinate chicken with yogurt and spices, then grill.",
      "Fry onions, garlic, and ginger until golden.",
      "Add tomatoes and spices and cook.",
      "Stir in cream and simmer until thickened.",
      "Add grilled chicken and cook until heated through.",
      "Serve with naan or rice."
    ],
    "image": "https://via.placeholder.com/150"
  }
]
